In [2]:
import pandas as pd
import numpy as np

In [6]:
df = pd.DataFrame(np.array([['Rafay',23,'M','BS(CS)'],['Ali',21,'M','BS(CS)']]))
df

       0   1  2       3
0  Rafay  23  M  BS(CS)
1    Ali  21  M  BS(CS)

In [8]:
df1 = pd.DataFrame([pd.Series(np.arange(10,15)),
                    pd.Series(np.arange(21,25))])
df1

      0     1     2     3     4
0  10.0  11.0  12.0  13.0  14.0
1  21.0  22.0  23.0  24.0   NaN

In [12]:
data = {'City' : ['Karachi','Lahore','Karachi','Peshawar','Quetta','Lahore'],
        'Year':[2009,2013,2017,2013,2018,2017],
        'Pop':[2.2,1.9,2.5,1.5,1.1,2.0]}

frame = pd.DataFrame(data)
frame

       City  Year  Pop
0   Karachi  2009  2.2
1    Lahore  2013  1.9
2   Karachi  2017  2.5
3  Peshawar  2013  1.5
4    Quetta  2018  1.1
5    Lahore  2017  2.0

In [13]:
pd.DataFrame(frame,columns=['Year','City','Pop'])

   Year      City  Pop
0  2009   Karachi  2.2
1  2013    Lahore  1.9
2  2017   Karachi  2.5
3  2013  Peshawar  1.5
4  2018    Quetta  1.1
5  2017    Lahore  2.0